---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PlanCircuit
source: html/050ac012-fc6c-de33-7f8f-b7a43959615e.htm
---
# PlanCircuit Members

Causes the object to release immediately any resources it may be utilizing.